<a href="https://colab.research.google.com/github/SainiManisha/dbms-tutorial/blob/master/MySQL_Constraints_Joins_Key.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /usr/local/lib/python3.6/dist-packages (8.0.21)
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.6/dist-packages (from mysql-connector-python) (3.12.4)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (50.3.0)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.6/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)

In [ ]:
import mysql.connector
import pandas as pd

In [ ]:
conn0 = mysql.connector.connect(
    host="34.93.147.110",
    user="root",
    password="123456789",
    port=3306
)

cur = conn0.cursor()

In [ ]:
query = """
    CREATE DATABASE organisation;
"""
cur.execute(query)

In [ ]:
conn = mysql.connector.connect(
    host="34.93.147.110",
    user="root",
    password="123456789",
    port=3306,
    database='organisation'
)

In [ ]:
cur = conn.cursor()

In [ ]:
query = """
    CREATE TABLE employee(
        id INT(10) PRIMARY KEY, 
        name TEXT NOT NULL,
        phone INT(10),
        email VARCHAR(50) NOT NULL UNIQUE
    )
"""
cur.execute(query)

In [ ]:
query = """
    INSERT INTO employee (id, name, phone, email) VALUES
        (1, "Employee A", 983003372, "employee.a@organisation.org"),
        (2, "Employee B", 983003371, "employee.b@organisation.org"),
        (3, "Employee C", 983003373, "employee.c@organisation.org"),
        (4, "Employee D", 983003374, "employee.d@organisation.org"),
        (5, "Employee E", 983003375, "employee.e@organisation.org")
"""
cur.execute(query)

In [ ]:
pd.read_sql("SELECT * FROM employee", conn)

   id        name      phone                        email
0   1  Employee A  983003372  employee.a@organisation.org
1   2  Employee B  983003371  employee.b@organisation.org
2   3  Employee C  983003373  employee.c@organisation.org
3   4  Employee D  983003374  employee.d@organisation.org
4   5  Employee E  983003375  employee.e@organisation.org

In [ ]:
query = """
    CREATE TABLE staff(
        id INT(10) PRIMARY KEY, 
        department TEXT NOT NULL DEFAULT("administration"),
        emp_id INT(10),
        FOREIGN KEY (emp_id) REFERENCES employee(id)
    )
"""
cur.execute(query)

In [26]:
query = """
    CREATE TABLE faculty(
        id INT(10) PRIMARY KEY, 
        department TEXT,
        designation TEXT,
        age INT(2) CHECK (age <= 60),
        emp_id INT(10),
        FOREIGN KEY (emp_id) REFERENCES employee(id)
    )
"""
cur.execute(query)

ERROR:root:An unexpected error occurred while tokenizing input
The following traceback may be corrupted or invalid
The error message is: ('EOF in multi-line string', (1, 43))

OperationalError: ignored

In [ ]:
pd.read_sql("SHOW TABLES", conn)

  Tables_in_organisation
0               employee
1                faculty
2                  staff

In [ ]:
query = """
    INSERT INTO staff (id, department, emp_id) VALUES
        (91, "security", 1),
        (92, "accounts", 2)
"""
cur.execute(query)

query = """
    INSERT INTO staff (id, emp_id) VALUES
        (93, 3)
"""
cur.execute(query)

In [ ]:
pd.read_sql("SELECT * FROM staff", conn)

   id      department  emp_id
0  91        security       1
1  92        accounts       2
2  93  administration       3

In [ ]:
query = """
    INSERT INTO faculty (id, department, designation, age, emp_id) VALUES
        (81, "CSE", "Assistant Professor", 67, 4),
        (82, "ME", "Associate Professor", 45, 5)
"""
cur.execute(query)

DatabaseError: ignored

In [ ]:
query = """
    INSERT INTO faculty (id, department, designation, age, emp_id) VALUES
        (81, "CSE", "Assistant Professor", 30, 4),
        (82, "ME", "Associate Professor", 45, 5)
"""
cur.execute(query)

In [ ]:
pd.read_sql("SELECT * FROM faculty", conn)

In [ ]:
query = """SELECT employee.id, employee.name, employee.email,
    faculty.id, faculty.department, faculty.age
    FROM employee INNER JOIN faculty
    ON faculty.emp_id = employee.id"""
pd.read_sql(query, conn)

   id        name                        email  id department  age
0   4  Employee D  employee.d@organisation.org  81        CSE   30
1   5  Employee E  employee.e@organisation.org  82         ME   45

In [ ]:
query = """
    DROP DATABASE organisation;
"""
cur.execute(query)